{
    "fp": [
        {
            "title": "Garbage Classification Model (HackIllinois 2023 Winner)",
            "icon": "",
            "img": "images/webapp.png",
            "img1": "images/ImageSegmentation.png",
            "img2": "images/awsS3.png",
            "caption": "The front-end for our webapp",
            "caption1": "Performing Image Segmentation on a jar to filter out background and get the jar's true color",
            "caption2": "The images we stored on AWS S3 to train our model",
            "imgid": "HackIllinois2023Img",
            "capid": "HackIllinois2023Cap",
            "circleid": "HackIllinois2023Circle",
            "shortDes": "This project won one of six grand prizes at HackIllinois 2023, UIUC's premiere hackathon with 750 participants this year. Working in a team of 4, we created a web-app where the user can upload images or descriptions of their trash, and our program will classify the trash into one of six categories: glass, compost, paper, hazardous waste, plastic and soft metals, residual waste",
            "longerDes": "I worked on the Computer Vision model for sorting the images of trash, Nancy worked on the frontend of our project, and Swathi + Robert worked on the Natural Language Processing Model for sorting descriptions of trash. I used AWS S3 to store large sets of training images, and AWS EC2 to train my Tensorflow Image Classification models to minimize the overhead on my computer. We also had to sort the glass bottles by color, so I used image segmentation to get the color of the glass. For our NLTK model, we used named entity recognition, neural networks, and synonyms to help our program understand the descriptions of trash.",
            "made": "2/24/2023 - 2/26/2023",
            "frameworks": [
                {
                    "name": "NLTK"
                },
                {
                    "name": "Tensorflow"
                },
                {
                    "name": "AWS S3"
                },
                {
                    "name": "Flask"
                }
            ],
            "website": "https://devpost.com/software/garbage-classification-model",
            "github": "https://github.com/Amitten77/HackIllinois2023",
            "color": "lightblue",
            "tagcolor": "#005AB5"
        }
    ]
}